# Reckitt MÃ©xico Data Science Project
## Data Collection and Cleaning
Author: Katlyn Goeujon-Mackness <br>
Last Updated: 11/06/2025 <br>
Description: As a first step in the Reckitt analysis, we collect the data together, clean it, transfor it, and export a ready-to-use data set for further analysis.

### Key Questions
1. Is our brand Vanish performing well overall?
2. Who are the key competitors in each segment?
3. Which are the main products gaining or losing market share?
4. Where are the key opportunities to grow the market and sales?
5. Are we performing well in sanitizing products?
6. Which area present the most opportunities, and what recommendations would you give to improve?
7. What is my sales forecase for Vanish and Lysol for the next three months, and what is the margin for error for this forecast.

### Load the data
Note: Due to large file sizes, raw data are not included in this repository.

In [1]:
# Load libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as py
import warnings
warnings.filterwarnings('ignore')

In [2]:
# Load the data from the different tables using Pandas
calendar = pd.read_excel('data/raw/DIM_CALENDAR.xlsx')
category = pd.read_csv('data/raw/DIM_CATEGORY.csv')
product = pd.read_excel('data/raw/DIM_PRODUCT.xlsx')
segment = pd.read_excel('data/raw/DIM_SEGMENT.xlsx')
sales = pd.read_csv('data/raw/FACT_SALES (1) (1).csv')

### Preview the Data
Load the first few roas of each DataFrame and view summaries.

In [3]:
# Calendar: Assigns information to the weeks of the year
calendar.head()

    WEEK  YEAR  MONTH  WEEK_NUMBER       DATE
0  01-21  2021      1            1 2021-01-10
1  02-21  2021      1            2 2021-01-17
2  03-21  2021      1            3 2021-01-24
3  04-21  2021      1            4 2021-01-31
4  05-21  2021      2            5 2021-02-07

In [4]:
calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   WEEK         156 non-null    object
 1   YEAR         156 non-null    int64
 2   MONTH        156 non-null    int64
 3   WEEK_NUMBER  156 non-null    int64
 4   DATE         156 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 6.2+ KB

In [5]:
category.head()

   ID_CATEGORY                        CATEGORY
0            1  FABRIC TREATMENT and SANIT\r\n
1            2                       AIR CARE
2            3                    LAVAVAJILLAS
3            4                MEGA SUPERFICIES
4            5             LAVATORY CARE & BRC

In [6]:
# Category: Describes the 5 product categories
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID_CATEGORY  5 non-null      int64
 1   CATEGORY     5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [7]:
# Product: Describes the individual products available
product.head()

,MANUFACTURER,BRAND,ITEM,ITEM_DESCRIPTION,CATEGORY,FORMAT,ATTR1,ATTR2,ATTR3
0,INDS. ALEN,CLORALEX,0000075000592,CLORALEX EL RENDIDOR BOT.PLAST. 250ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
1,INDS. ALEN,CLORALEX,0000075000608,CLORALEX EL RENDIDOR BOT.PLAST. 500ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
2,INDS. ALEN,CLORALEX,0000075000615,CLORALEX EL RENDIDOR BOT.PLAST. 950ML NAL. 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
3,INDS. ALEN,CLORALEX,0000075000622,CLORALEX EL RENDIDOR BOT.PLAST. 2000ML NAL 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
4,INDS. ALEN,CLORALEX,0000075000639,CLORALEX EL RENDIDOR BOT.PLAST. 3750ML NAL 000...,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO

In [8]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 505 entries, 0 to 504
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   MANUFACTURER      505 non-null    object
 1   BRAND             505 non-null    object
 2   ITEM              503 non-null    object
 3   ITEM_DESCRIPTION  505 non-null    object
 4   CATEGORY          505 non-null    int64
 5   FORMAT            505 non-null    object
 6   ATTR1             499 non-null    object
 7   ATTR2             505 non-null    object
 8   ATTR3             499 non-null    object
dtypes: int64(1), object(8)
memory usage: 35.6+ KB

In [9]:
# Segment: Defines categorical groupings
segment.head()

   CATEGORY  ATTR1  ATTR2      ATTR3   FORMAT SEGMENT
0         1  CLORO  CLORO    BAMBINO  LIQUIDO  BLEACH
1         1  CLORO  CLORO  GERMICIDA  LIQUIDO  BLEACH
2         1  CLORO  CLORO   MASCOTAS  LIQUIDO  BLEACH
3         1  CLORO  CLORO  MULTIUSOS      GEL  BLEACH
4         1  CLORO  CLORO  MULTIUSOS  LIQUIDO  BLEACH

In [10]:
segment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CATEGORY  53 non-null     int64
 1   ATTR1     53 non-null     object
 2   ATTR2     53 non-null     object
 3   ATTR3     52 non-null     object
 4   FORMAT    53 non-null     object
 5   SEGMENT   53 non-null     object
dtypes: int64(1), object(5)
memory usage: 2.6+ KB

In [11]:
# Sales: Defines actual sales history by week
sales.head()

,WEEK,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION
0,34-22,7501058792808BP2,0.006,0.139,1.000,TOTAL AUTOS AREA 5
1,34-22,7501058715883,0.487,116.519,2.916,TOTAL AUTOS AREA 5
2,34-22,7702626213774,1.391,68.453,5.171,TOTAL AUTOS AREA 5
3,34-22,7501058716422,0.022,1.481,1.833,TOTAL AUTOS AREA 5
4,34-22,7501058784353,2.037,182.839,5.375,TOTAL AUTOS AREA 5

In [12]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122002 entries, 0 to 122001
Data columns (total 6 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   WEEK                         122002 non-null  object
 1   ITEM_CODE                    122002 non-null  object
 2   TOTAL_UNIT_SALES             122002 non-null  float64
 3   TOTAL_VALUE_SALES            122002 non-null  float64
 4   TOTAL_UNIT_AVG_WEEKLY_SALES  122002 non-null  float64
 5   REGION                       122002 non-null  object
dtypes: float64(3), object(3)
memory usage: 5.6+ MB

In [13]:
sales.describe()

       TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES
count     122002.000000      122002.000000                122002.000000
mean           3.211097          90.513761                    10.099904
std           14.496009         350.236505                    22.650142
min            0.000000           0.001000                     0.042000
25%            0.063000           2.662000                     2.316000
50%            0.367000          16.812000                     3.993500
75%            1.520000          62.961500                     8.898000
max          504.681000       12236.759000                   794.000000

### Data Cleaning
#### CALENDAR DAtaset

In [14]:
# Check for duplicate values
print("Date Duplicates: ", calendar.duplicated(['DATE']).value_counts())
print("Week Duplicates: ", calendar.duplicated(['WEEK']).value_counts())

Date Duplicates:  False    156
Name: count, dtype: int64
Week Duplicates:  False    156
Name: count, dtype: int64

In [15]:
# Ensure standardization on WEEK - Should be XX-XX format

# Define patter w/ regex
pattern = r'^\d{2}-\d{2}$'
invalid_weeks = ~calendar['WEEK'].astype(str).str.match(pattern)

# Check invalid weeks, if any
if invalid_weeks.any():
    print(calendar[invalid_weeks])
else:
    print("No invalid weeks")

No invalid weeks

In [16]:
# Validate that DATE values are always on the same day of the week

# Get the day of the week for the first week in the calendar
day_of_the_week = calendar.loc[0, 'DATE'].day_name()
print(f"First week is a {day_of_the_week}")

# Check that all the days of the week match for the remaining weeks
date_condition = calendar['DATE'].dt.day_name() == day_of_the_week
if all(date_condition):
    print(f"All dates are {day_of_the_week}s")
else:
    print("Dates are NOT consistent.")

First week is a Sunday
Dates are NOT consistent.

In [17]:
# Diagnose the day of the week inconsistencies

# Check each weekday for the dates (0=Monday, 6=Sunday)
calendar['weekday'] = calendar['DATE'].dt.weekday
calendar['weekday'].value_counts()

weekday
6    104
0     52
Name: count, dtype: int64

In [18]:
# Standardize the DATE anchor from Sunday to Monday
calendar.loc[calendar['DATE'].dt.weekday == 6, 'DATE'] += pd.Timedelta(days=1)

In [19]:
# Drop weekday column
calendar.drop(columns=["weekday"], inplace=True)

# Verify changes
calendar.head()

    WEEK  YEAR  MONTH  WEEK_NUMBER       DATE
0  01-21  2021      1            1 2021-01-11
1  02-21  2021      1            2 2021-01-18
2  03-21  2021      1            3 2021-01-25
3  04-21  2021      1            4 2021-02-01
4  05-21  2021      2            5 2021-02-08

In [20]:
# Validate that WEEK_NUMBER resets to 1 every January

# Filter for the weeks in January
jan_weeks = calendar[calendar['MONTH'] == 1]
jan_weeks

      WEEK  YEAR  MONTH  WEEK_NUMBER       DATE
0    01-21  2021      1            1 2021-01-11
1    02-21  2021      1            2 2021-01-18
2    03-21  2021      1            3 2021-01-25
3    04-21  2021      1            4 2021-02-01
52   01-22  2022      1            1 2022-01-10
53   02-22  2022      1            2 2022-01-17
54   03-22  2022      1            3 2022-01-24
55   04-22  2022      1            4 2022-01-31
103  52-22  2022      1           52 2023-01-02
104  01-23  2023      1            1 2023-01-09
105  02-23  2023      1            2 2023-01-16
106  03-23  2023      1            3 2023-01-23
107  04-23  2023      1            4 2023-01-30
155  52-23  2023      1           52 2024-01-01

In [21]:
# Validate that weeks increase sequentially
for year, group in calendar.groupby('YEAR'):
    diffs = group['WEEK_NUMBER'].diff().dropna()
    invalid_weeks = group.iloc[1:][diffs != 1]

    if not invalid_weeks.empty:
        print(f"Problem: {invalid_weeks}")
    else:
        print("No invalid weeks")

No invalid weeks
No invalid weeks
No invalid weeks

In [22]:
# Validate that there are no missing weeks between the min and max weeks

# Compare generated data to calendar
expected_weeks = pd.date_range(
    start=calendar['DATE'].min(),
    end=calendar['DATE'].max(),
    freq='W-MON'
)
actual_weeks = calendar['DATE'].sort_values()
missing = expected_weeks.difference(actual_weeks)
if missing.empty:
    print("No missing weeks")
else:
    print(f"Missing: {missing}")

No missing weeks

#### CATEGORY Dataset

In [23]:
# Strip whitespace
category['CATEGORY'] = category['CATEGORY'].astype(str).str.strip().str.upper().str.replace(r'\s+', ' ', regex=True)

# Category names are inconsistent Spanish/English 
#    Reassign names to normalize
category['CATEGORY'] = category['CATEGORY'].replace({
    "FABRIC TREATMENT AND SANIT": "FABRIC TREATMENT & SANITIZERS",
    "LAVAVAJILLAS": "DISHWASHING",
    "MEGA SUPERFICIES": "SURFACE CLEANERS"
})
category

   ID_CATEGORY                       CATEGORY
0            1  FABRIC TREATMENT & SANITIZERS
1            2                       AIR CARE
2            3                    DISHWASHING
3            4               SURFACE CLEANERS
4            5            LAVATORY CARE & BRC

#### PRODUCT Dataset

In [24]:
# Missing value handling
cols = product[["ATTR1",
               "ATTR2",
               "ATTR3"]]
# Fill undefined attributes
for col in cols:
    product[col] = product[col].fillna('UNDEFINED')

product.isnull().sum()

MANUFACTURER        0
BRAND               0
ITEM                2
ITEM_DESCRIPTION    0
CATEGORY            0
FORMAT              0
ATTR1               0
ATTR2               0
ATTR3               0
dtype: int64

In [25]:
# Investigate missing values in ITEM
product[product['ITEM'].isnull()]

,MANUFACTURER,BRAND,ITEM,ITEM_DESCRIPTION,CATEGORY,FORMAT,ATTR1,ATTR2,ATTR3
502,INDS. ALEN,CLORALEX,NaN,CLORALEX EL RENDIDOR BOT PLAST 2LT,1,LIQUIDO,CLORO,CLORO,NO DEFINIDO
503,CLOROX,CLOROX,NaN,CLOROX MASCOTAS BLANQUEADOR+DETERGENTE GALON 10L,1,LIQUIDO,CLORO,CLORO,MASCOTAS

In [26]:
# Drop records with missing item number, as these cannot be reliably joined for analysis
product = product.dropna(subset=['ITEM'])

In [27]:
# Text Normalization - Strip whitespace and normalize case in string columns
text_cols = ['MANUFACTURER',
             'BRAND',
             'ITEM',
             'ITEM_DESCRIPTION',
             'FORMAT',
             'ATTR1',
             'ATTR2',
             'ATTR3']

for col in text_cols:
    product[col] = (product[col]
                    .astype(str)    # Enforce data type as string
                    .str.strip()    # Remove hanging spaces
                    .str.upper()    # Normalize to uppercase 
                    .str.replace(r'\s+', ' ', regex=True)   # Remove special whitespace characters
                    
                    # Fix inconsistencies 
                    .str.replace('NO DEFINIDO', 'UNDEFINED')    # Ensure consistency with English/Spanish content - undefined values
                    .str.replace("PRE LAVADOR", "PRELAVADOR")    # Ensure consistency within categories

    )

In [28]:
# Verify category consistency
invalid_categories = product[~product['CATEGORY'].between(1,5)]

if invalid_categories.empty:
    print("No invalid categories")
else:
    print("Found invalid categories.")

No invalid categories

In [29]:
# Type enforcement
product['ITEM'] = (
    product['ITEM']
    .astype(str)        # Make sure ITEM column is enforced as string
    .str.zfill(13)      # Pad the digits to fill 13
)

In [30]:
# Deduplication
product.drop_duplicates(inplace=True)

In [31]:
# Prepare dataset for joining - ensure consistency with Format and Attributes
unique_prod_format = product['FORMAT'].unique()
unique_prod_attr1 = product['ATTR1'].unique()
unique_prod_attr2 = product['ATTR2'].unique()
unique_prod_attr3 = product['ATTR3'].unique()

print("Unique FORMATS:", unique_prod_format)
print("Unique ATTRIBUTE 1:", unique_prod_attr1)
print("Unique ATTRIBUTE 2:", unique_prod_attr2)
print("Unique ATTRIBUTE 3:", unique_prod_attr3)

Unique FORMATS: ['LIQUIDO' 'POLVO' 'GEL' 'TOALLAS' 'BARRA']
Unique ATTRIBUTE 1: ['CLORO' 'SANITIZANTE' 'SAFE BLEACH' 'PRELAVADOR' 'UNDEFINED']
Unique ATTRIBUTE 2: ['CLORO' 'SANITIZANTE' 'FABRIC TREATMENT']
Unique ATTRIBUTE 3: ['UNDEFINED' 'OTR. TIPOS' 'SANITIZANTE' 'PRELAVADOR' 'COLOR PODER VINAGRE'
 'QUITAMANCHAS' 'ROPA COLOR' 'MULTIUSOS' 'BLANCO' 'GERMICIDA' 'BAMBINO'
 'ROPA BEBE' 'MASCOTAS' 'ROSA' 'ROPA BLANCA']

In [32]:
# Rename columns for consistency
product.rename(columns={
    "ITEM": "ITEM_CODE",
    "CATEGORY": "ID_CATEGORY"
}, inplace=True)

In [33]:
# Preview a random selection
product.sample(5, random_state=5)

,MANUFACTURER,BRAND,ITEM_CODE,ITEM_DESCRIPTION,ID_CATEGORY,FORMAT,ATTR1,ATTR2,ATTR3
378,CLOROX,CLOROX,7501071904349,CLOROX ROPA COLORES VIVOS OXIGENO ACTIVO GALON...,1,LIQUIDO,SAFE BLEACH,FABRIC TREATMENT,ROPA COLOR
407,CLOROX,CLOROX,7501071907722,CLOROX ANTISPLASH BLANQ+DET GEL FLORES DE LAVA...,1,GEL,CLORO,CLORO,MULTIUSOS
90,INDS. ALEN,CLORALEX,7501025400361,CLORALEX GERANIO Y ALOE BOT PLAS 2 LT 75010254...,1,LIQUIDO,CLORO,CLORO,UNDEFINED
409,CLOROX,CLOROX,7501071908385,CLOROX ANTISPLASH BLANQ+DET GEL BP 3800ML 7501...,1,GEL,CLORO,CLORO,MULTIUSOS
443,JABONERA LA ESPUMA,BANDERA,7501681100018,BANDERA BLANQUEADOR LIMPIA DESEINFECTA BOT PLA...,1,LIQUIDO,CLORO,CLORO,UNDEFINED

#### SEGMENT Dataset

In [34]:
segment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CATEGORY  53 non-null     int64
 1   ATTR1     53 non-null     object
 2   ATTR2     53 non-null     object
 3   ATTR3     52 non-null     object
 4   FORMAT    53 non-null     object
 5   SEGMENT   53 non-null     object
dtypes: int64(1), object(5)
memory usage: 2.6+ KB

In [35]:
# Handle Missing Value
segment['ATTR3'] = segment['ATTR3'].fillna('UNDEFINED')

In [36]:
# Text Normalization
attr_cols = ['ATTR1',
             'ATTR2',
             'ATTR3',
             'FORMAT',
             'SEGMENT']

for col in attr_cols:
    segment[col] = (segment[col]
                    .astype(str)    # Enforce string datatype
                    .str.strip()    # Remove hanging spaces
                    .str.replace(r'\s+', ' ', regex=True)   # Remove whitespace characters
                    .str.replace("NO DEFINIDO", "UNDEFINED")    # Ensure consistency with Spanish/English
                    .str.replace("PRE LAVADOR", "PRELAVADOR")    # Ensure consistency within categories
                    )

In [37]:
# Verify category consistency
invalid_categories = segment[~segment['CATEGORY'].between(1,5)]

if invalid_categories.empty:
    print("No invalid categories")
else:
    print("Found invalid categories.")

No invalid categories

In [38]:
# Prepare dataset for joining - ensure consistency with Format and Attributes
unique_seg_attr1 =  segment['ATTR1'].unique()
unique_seg_attr2 =  segment['ATTR2'].unique()
unique_seg_attr3 =  segment['ATTR3'].unique()
unique_seg_format =  segment['FORMAT'].unique()
unique_seg_segment = segment['SEGMENT'].unique()

print("Unique ATTRIBUTE 1:", unique_seg_attr1)
print("Unique ATTRIBUTE 2:", unique_seg_attr2)
print("Unique ATTRIBUTE 3:", unique_seg_attr3)
print("Unique FORMATS:", unique_seg_format)
print("Unique SEGMENT:", unique_seg_segment)

Unique ATTRIBUTE 1: ['CLORO' 'PRELAVADOR' 'SAFE BLEACH' 'SANITIZANTE']
Unique ATTRIBUTE 2: ['CLORO' 'MASCOTAS' 'MULTIUSOS' 'UNDEFINED' 'FABRIC TREATMENT'
 'PRELAVADOR' 'SANITIZANTE']
Unique ATTRIBUTE 3: ['BAMBINO' 'GERMICIDA' 'MASCOTAS' 'MULTIUSOS' 'UNDEFINED' 'OTR. TIPOS'
 'ROPA BEBE' 'BLANCO' 'PRELAVADOR' 'QUITAMANCHAS' 'ROPA COLOR' 'ROSA'
 'COLOR PODER VINAGRE' 'PODER OXIGENO' 'ROPA BLANCA' 'SANITIZANTE']
Unique FORMATS: ['LIQUIDO' 'GEL' 'POLVO' 'TOALLAS' 'BARRA']
Unique SEGMENT: ['BLEACH' 'LIQUID & GEL' 'POWDER' 'OTHERS' 'PRETREAT' 'BAR' 'SANITIZER']

In [39]:
# Rename columns for consistency
segment.rename(columns={'CATEGORY': 'ID_CATEGORY'}, inplace=True)

In [40]:
segment.head()

   ID_CATEGORY  ATTR1  ATTR2      ATTR3   FORMAT SEGMENT
0            1  CLORO  CLORO    BAMBINO  LIQUIDO  BLEACH
1            1  CLORO  CLORO  GERMICIDA  LIQUIDO  BLEACH
2            1  CLORO  CLORO   MASCOTAS  LIQUIDO  BLEACH
3            1  CLORO  CLORO  MULTIUSOS      GEL  BLEACH
4            1  CLORO  CLORO  MULTIUSOS  LIQUIDO  BLEACH

#### SALES Dataset

In [41]:
sales.describe()

       TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES
count     122002.000000      122002.000000                122002.000000
mean           3.211097          90.513761                    10.099904
std           14.496009         350.236505                    22.650142
min            0.000000           0.001000                     0.042000
25%            0.063000           2.662000                     2.316000
50%            0.367000          16.812000                     3.993500
75%            1.520000          62.961500                     8.898000
max          504.681000       12236.759000                   794.000000

In [42]:
# Standardize column names
sales.columns = sales.columns.str.strip().str.upper().str.replace(r'\s+', ' ', regex=True)

In [43]:
# Standardize dates - convert week to datetime using the Calendar lookup table
sales = sales.merge(calendar[['WEEK', 'DATE']], on='WEEK', how='left')

# Verify no null date values/mismatches
sales[sales['DATE'].isnull()]

Empty DataFrame
Columns: [WEEK, ITEM_CODE, TOTAL_UNIT_SALES, TOTAL_VALUE_SALES, TOTAL_UNIT_AVG_WEEKLY_SALES, REGION, DATE]
Index: []

In [44]:
# Week column from calendar and sales as they are no longer needed
sales.drop(columns=["WEEK"], inplace=True)
calendar.drop(columns=["WEEK"], inplace=True)

# Move DATE in sales to the the first position
cols = sales.columns.tolist()
cols.insert(0, cols.pop(cols.index('DATE')))
sales = sales[cols]

In [45]:
# Verify changes
print("Sales columns:", sales.columns)
print("Calendar columns:", calendar.columns)

Sales columns: Index(['DATE', 'ITEM_CODE', 'TOTAL_UNIT_SALES', 'TOTAL_VALUE_SALES',
       'TOTAL_UNIT_AVG_WEEKLY_SALES', 'REGION'],
      dtype='object')
Calendar columns: Index(['YEAR', 'MONTH', 'WEEK_NUMBER', 'DATE'], dtype='object')

In [46]:
# Data type enforcement

# Ensure ITEM_CODE is in string format and consistent with product table
sales['ITEM_CODE'] = (
    sales['ITEM_CODE']
    .astype(str)        # Make sure ITEM column is enforced as string
    .str.zfill(13)      # Pad the digits to fill 13
)

# Ensure numeric fields are actually numeric
numeric_cols = ['TOTAL_UNIT_SALES',
                'TOTAL_VALUE_SALES',
                'TOTAL_UNIT_AVG_WEEKLY_SALES']

for col in numeric_cols:
    sales[col] = pd.to_numeric(sales[col], errors='coerce') # Changes any anomalies to NaN

# Inspect any nulls
sales[numeric_cols].isnull().sum()

TOTAL_UNIT_SALES               0
TOTAL_VALUE_SALES              0
TOTAL_UNIT_AVG_WEEKLY_SALES    0
dtype: int64

In [47]:
# Text Normalization for region
sales['REGION'] = (sales['REGION']
                    .astype(str)    # Enforce string datatype
                    .str.strip()    # Remove hanging spaces
                    .str.replace(r'\s+', ' ', regex=True)   # Remove whitespace characters
                    .str.replace("NO DEFINIDO", "UNDEFINED")    # Ensure consistency with Spanish/English
                    )

In [48]:
# Handle missing values
sales.isnull().value_counts()

DATE   ITEM_CODE  TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES  REGION
False  False      False             False              False                        False     122002
Name: count, dtype: int64

In [49]:
# Check for duplicate values
print("Duplicates: ", sales.duplicated().value_counts())

Duplicates:  False    122002
Name: count, dtype: int64

In [50]:
# Investigate 0 values in TOTAL_UNIT_SALES
zero_sales = sales[sales['TOTAL_UNIT_SALES'] == 0]
zero_sales.groupby(['ITEM_CODE']).size()

ITEM_CODE
0757037517123     1
7501058716439     8
7501071901393     2
7501071902314     9
7501071907715    16
7501071907722    23
7501071907784     4
7501080900134    15
dtype: int64

#### Comments:
Records with 0.00 in sales but a small monetary amount in total value seem to be clustered on certain products. This could be relevant in analysis, so we will keep the records in the dataset and investigate further during analysis.

In [51]:
sales.sample(5, random_state=5)

,DATE,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION
16703,2022-08-22,7501058757630,0.296,29.417,3.083,TOTAL AUTOS AREA 3
67221,2022-08-01,7501058716798,0.254,37.854,2.028,TOTAL AUTOS AREA 2
78554,2023-01-09,7501025402242,1.663,60.283,5.716,TOTAL AUTOS AREA 2
80044,2023-05-08,7501681100384,0.207,3.043,4.814,TOTAL AUTOS AREA 6
50966,2022-08-08,7501058795908,0.111,24.168,2.094,TOTAL AUTOS AREA 6

### Join the data

In [52]:
# Create one consolidated dataset ready for transformation and analysis
sales_consolidated = (sales
                    .merge(calendar, on='DATE', how='left')
                    .merge(product, on='ITEM_CODE', how='left')
                    .merge(category, on='ID_CATEGORY', how='left')
                    .merge(segment, on=['ID_CATEGORY', 'ATTR1', 'ATTR2', 'ATTR3', 'FORMAT'], how='left')
                    )

In [53]:
# Preview consolidated table as a sample
sales_consolidated.sample(5, random_state=5)

,DATE,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION,YEAR,MONTH,WEEK_NUMBER,MANUFACTURER,BRAND,ITEM_DESCRIPTION,ID_CATEGORY,FORMAT,ATTR1,ATTR2,ATTR3,CATEGORY,SEGMENT
142705,2023-05-15,7501071902956,8.179,395.809,14.871,TOTAL AUTOS SCANNING MEXICO,2023,5,19,CLOROX,CLOROX,CLOROX BLANQUEADOR CONCENTRADO 5.8L NAL 750107...,1,LIQUIDO,CLORO,CLORO,UNDEFINED,FABRIC TREATMENT & SANITIZERS,BLEACH
42084,2022-08-08,7501025401313,1.569,89.069,12.861,TOTAL AUTOS AREA 3,2022,8,31,INDS. ALEN,CLORALEX,CLORALEX CLORO EN GEL BOT 3.75L 7501025401313,1,GEL,CLORO,CLORO,MULTIUSOS,FABRIC TREATMENT & SANITIZERS,BLEACH
46307,2022-04-11,7501681100438,0.211,5.784,6.213,TOTAL AUTOS AREA 6,2022,4,14,JABONERA LA ESPUMA,BANDERA,BANDERA CLORHADA AROMA NAVIDENO BOT PLAS 3.8 L...,1,LIQUIDO,CLORO,CLORO,UNDEFINED,FABRIC TREATMENT & SANITIZERS,BLEACH
126504,2022-03-21,7501042301733,2.428,46.725,32.373,TOTAL AUTOS AREA 2,2022,3,11,QUIMICA GONCAL,CLORTEX,CLORTEX BLANQUEADOR BOT 1890ML NAL 7501042301733,1,LIQUIDO,CLORO,CLORO,UNDEFINED,FABRIC TREATMENT & SANITIZERS,BLEACH
96116,2023-05-08,7501058784346,0.491,75.223,2.372,TOTAL AUTOS AREA 2,2023,5,18,RECKITT,VANISH,VANISH PODER 02 INTELLIGENCE POLVO BOT 900 GR ...,1,POLVO,SAFE BLEACH,FABRIC TREATMENT,ROSA,FABRIC TREATMENT & SANITIZERS,POWDER

In [54]:
# Validate merge for nulls
sales_consolidated.isnull().value_counts()

DATE   ITEM_CODE  TOTAL_UNIT_SALES  TOTAL_VALUE_SALES  TOTAL_UNIT_AVG_WEEKLY_SALES  REGION  YEAR   MONTH  WEEK_NUMBER  MANUFACTURER  BRAND  ITEM_DESCRIPTION  ID_CATEGORY  FORMAT  ATTR1  ATTR2  ATTR3  CATEGORY  SEGMENT
False  False      False             False              False                        False   False  False  False        False         False  False             False        False   False  False  False  False     False      152402
Name: count, dtype: int64

### Transform the data
Now that the data is well-structured, it is ready for some transformations that will get it ready for analysis.

In [55]:
sales_consolidated.describe()

,DATE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,YEAR,MONTH,WEEK_NUMBER,ID_CATEGORY
count,152402,152402.000000,152402.000000,152402.000000,152402.000000,152402.000000,152402.000000,152402.0
mean,2022-10-07 03:55:40.160890368,4.073802,109.382632,12.624333,2022.335225,5.536509,22.163095,1.0
min,2022-01-10 00:00:00,0.000000,0.001000,0.042000,2022.000000,1.000000,1.000000,1.0
25%,2022-05-23 00:00:00,0.065000,2.389250,2.482000,2022.000000,3.000000,10.000000,1.0
50%,2022-10-03 00:00:00,0.419000,17.123500,4.785500,2022.000000,5.000000,20.000000,1.0
75%,2023-02-27 00:00:00,1.874750,68.948500,11.484000,2023.000000,8.000000,32.000000,1.0
max,2023-07-17 00:00:00,504.681000,12236.759000,794.000000,2023.000000,12.000000,52.000000,1.0
std,NaN,17.737193,428.975845,27.755958,0.472071,3.216616,14.143258,0.0

#### Comments:
The following changes can be made:
* Log-Transformation: Long-tailed distributions on TOTAL_UNIT_SALES, TOTAL_VALUE_SALES, and TOTAL_UNIT_AVG_WEEKLY_SALES.
* Feature Engineering:
    * UNIT_PRICE from TOTAL_VALUE_SALES and TOTAL_UNIT_SALES

In [56]:
# Log transform sales data
for col in ['TOTAL_UNIT_SALES', 'TOTAL_VALUE_SALES', 'TOTAL_UNIT_AVG_WEEKLY_SALES']:
    sales_consolidated[f'log_{col}'] = np.log1p(sales_consolidated[col])

In [57]:
# Feature engineering, UNIT_PRICE
sales_consolidated['UNIT_PRICE'] = np.where(
    sales_consolidated['TOTAL_UNIT_SALES'] != 0,
        sales_consolidated['TOTAL_VALUE_SALES'] / sales_consolidated['TOTAL_UNIT_SALES'],
        0
)

In [58]:
# Preview final consolidated DataFrame, ready for export
sales_consolidated.head(3)

,DATE,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION,YEAR,MONTH,WEEK_NUMBER,MANUFACTURER,...,FORMAT,ATTR1,ATTR2,ATTR3,CATEGORY,SEGMENT,log_TOTAL_UNIT_SALES,log_TOTAL_VALUE_SALES,log_TOTAL_UNIT_AVG_WEEKLY_SALES,UNIT_PRICE
0,2022-08-29,7501058792808BP2,0.006,0.139,1.000,TOTAL AUTOS AREA 5,2022,8,34,RECKITT,...,POLVO,SAFE BLEACH,FABRIC TREATMENT,ROSA,FABRIC TREATMENT & SANITIZERS,POWDER,0.005982,0.130151,0.693147,23.166667
1,2022-08-29,7501058715883,0.487,116.519,2.916,TOTAL AUTOS AREA 5,2022,8,34,RECKITT,...,POLVO,SAFE BLEACH,FABRIC TREATMENT,ROSA,FABRIC TREATMENT & SANITIZERS,POWDER,0.396761,4.766600,1.365071,239.258727
2,2022-08-29,7702626213774,1.391,68.453,5.171,TOTAL AUTOS AREA 5,2022,8,34,RECKITT,...,POLVO,SAFE BLEACH,FABRIC TREATMENT,ROSA,FABRIC TREATMENT & SANITIZERS,POWDER,0.871712,4.240650,1.819861,49.211359

### Export the data

In [59]:
# Export consolidated sales DataFrame for modelling
sales_consolidated.to_csv('data/processed/sales_consolidated.csv', index=False)

In [63]:
# Connect to database and save cleaned DataFrames as tables with SQL
import sqlite3

# Connect to database
conn = sqlite3.connect('reckitt_sales.db')

# Write DataFrames to tables in SQL
calendar.to_sql('DIM_CALENDAR', conn, if_exists='replace', index=False)
category.to_sql('DIM_CATEGORY', conn, if_exists='replace', index=False)
product.to_sql('DIM_PRODUCT', conn, if_exists='replace', index=False)
segment.to_sql('DIM_SEGMENT', conn, if_exists='replace', index=False)
sales.to_sql('FACT_SALES', conn, if_exists='replace', index=False)

# Verify database writing
pd.read_sql('SELECT * FROM FACT_SALES LIMIT 5', conn)

,DATE,ITEM_CODE,TOTAL_UNIT_SALES,TOTAL_VALUE_SALES,TOTAL_UNIT_AVG_WEEKLY_SALES,REGION
0,2022-08-29 00:00:00,7501058792808BP2,0.006,0.139,1.000,TOTAL AUTOS AREA 5
1,2022-08-29 00:00:00,7501058715883,0.487,116.519,2.916,TOTAL AUTOS AREA 5
2,2022-08-29 00:00:00,7702626213774,1.391,68.453,5.171,TOTAL AUTOS AREA 5
3,2022-08-29 00:00:00,7501058716422,0.022,1.481,1.833,TOTAL AUTOS AREA 5
4,2022-08-29 00:00:00,7501058784353,2.037,182.839,5.375,TOTAL AUTOS AREA 5

In [61]:
# Store cleaned and structured data in an SQL database
# SQL helps organize the data and make it easier for retrival.
# Use SQL for fast queries
#  Guarda el DataFrame consolidado en un nuevo archivo CSV o Excel para su uso posterior en el anÃ¡lisis.

In [62]:
# Archivo final
# Un archivo Jupyter Notebook (.ipynb) con los scripts utilizados para cargar,
#   limpiar, transformar y consolidar los datos.